In [6]:
import pandas as pd

s1 = pd.Series({
    '김': 100,
    '나': 141,
    '박': 129,
    '이': 124
})

s1.name = '수학'

print(s1)

s2 = pd.Series({
    '김': 30,
    '나': 5,
    '박': 1239,
    '이': 141
})

print(s2)

s3 = pd.Series([8, 3, 13, 21])
s3.name = '국어'
print(s3)

s4 = pd.Series([30, 5, 1239, 1411])
print(s4)

김    100
나    141
박    129
이    124
Name: 수학, dtype: int64
김      30
나       5
박    1239
이     141
dtype: int64
0     8
1     3
2    13
3    21
Name: 국어, dtype: int64
0      30
1       5
2    1239
3    1411
dtype: int64

# 데이터 프레임

In [8]:
df = pd.DataFrame({
    '출생지': ['한국', '미국'],
    '나이': ['20', '30'],   
})

df

  출생지  나이
0  한국  20
1  미국  30

In [10]:
df['성별'] = ['여', '남자']

df

  출생지  나이  성별
0  한국  20   여
1  미국  30  남자

In [11]:
df.loc[2] = ['일본', 25, '여']

In [12]:
df

  출생지  나이  성별
0  한국  20   여
1  미국  30  남자
2  일본  25   여

In [14]:
df2 = pd.DataFrame(s1)
df2['영어'] = s2
df2['미술'] = [1, 2, 3, 4]

df2

    수학    영어  미술
김  100    30   1
나  141     5   2
박  129  1239   3
이  124   141   4

In [15]:
df2[['수학', '미술']]

    수학  미술
김  100   1
나  141   2
박  129   3
이  124   4

In [17]:
df2.loc[['김', '박']]

    수학    영어  미술
김  100    30   1
박  129  1239   3

In [19]:
df2.loc[['김'],['미술', '영어']]

   미술  영어
김   1  30

In [20]:
df2

    수학    영어  미술
김  100    30   1
나  141     5   2
박  129  1239   3
이  124   141   4

In [27]:
print(df2.sum())
print(df2.mean(axis=1))
print(df2['수학'].mean())

수학     494
영어    1415
미술      10
dtype: int64
김     43.666667
나     49.333333
박    457.000000
이     89.666667
dtype: float64
123.5

# 미션1

In [29]:
print(df2.loc[df2['영어']>=100, '수학'].mean())

126.5

In [32]:
# print(df2.loc[df2['영어']>=100, '수학'].mean())
df2.loc[df2['영어'] >= 100, '수학'].mean()

126.5